##
# brews
##
brew "curl"
brew "direnv"
brew "gifsicle"
brew "git"
brew "git-lfs"
brew "gpg"
brew "heroku"
brew "hub"
brew "iproute2mac"
brew "mas"
brew "nmap"
brew "nvm"
brew "openssl"
brew "python@2"
brew "python3"
brew "readline"
brew "shellcheck"
brew "tldr"
brew "tree"
brew "wget"
brew "wrk"
brew "yarn"
brew "youtube-dl"
brew "zsh"
brew "zsh-completions"
brew "zsh-syntax-highlighting"

##
# casks
##
tap "buo/cask-upgrade"
tap "caskroom/drivers"
tap "caskroom/versions"

cask "1password"
cask "adobe-acrobat-reader"
cask "android-file-transfer"
cask "bittorrent"
cask "boostnote"
cask "brave"
cask "caffeine"
cask "darktable"
cask "dash"
cask "docker"
cask "dropbox"
cask "fiddler"
cask "firefox"
cask "forklift"
cask "ghost"
cask "google-chrome"
cask "gpgtools-beta"
cask "handbrake"
cask "hp-easy-start"
cask "inssider"
cask "intellij-idea-ce"
cask "iterm2"
cask "java"
cask "keepassxc"
cask "keka"
cask "libreoffice"
cask "licecap"
cask "logitech-myharmony"
cask "mactex"
cask "macvim"
cask "microsoft-office"
cask "psequel"
cask "sabnzbd"
cask "sequel-pro"
cask "signal"
cask "skype"
cask "slack"
cask "spectacle"
cask "spotify"
cask "steam"
cask "synology-cloud-station-drive"
cask "synology-photo-station-uploader"
cask "teamspeak-client"
cask "teamviewer"
cask "telegram"
cask "tunnelblick"
cask "twitch"
cask "virtualbox"
cask "visual-studio-code"
cask "vlc"
cask "vmware-fusion"
cask "whatsapp"
cask "wireshark"
cask "xbox360-controller-driver-unofficial"

# QuickLook plugins
cask "qlcolorcode"
cask "qlstephen"
cask "qlmarkdown"
cask "quicklook-json"
cask "betterzipql"
cask "suspicious-package"

##
# Mac App Store
##
mas "iMovie", id: 408981434
mas "Wunderlist", id: 410628904
mas "Xcode", id: 497799835
